MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/mkv58f512vlq24.s
    .weak      ENC_INDEX_IRQHandler
    .thumb_set ENC_INDEX_IRQHandler,Default_Handler

    .weak      CMP2_IRQHandler
    .thumb_set CMP2_IRQHandler,Default_Handler

    .weak      FTM3_IRQHandler
    .thumb_set FTM3_IRQHandler,Default_Handler

    .weak      Reserved88_IRQHandler
    .thumb_set Reserved88_IRQHandler,Default_Handler

    .weak      HSADC0_CCB_IRQHandler
    .thumb_set HSADC0_CCB_IRQHandler,Default_Handler

    .weak      HSADC1_CCA_IRQHandler
    .thumb_set HSADC1_CCA_IRQHandler,Default_Handler

    .weak      CAN0_ORed_Message_buffer_IRQHandler
    .thumb_set CAN0_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN0_Bus_Off_IRQHandler
    .thumb_set CAN0_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN0_Error_IRQHandler
    .thumb_set CAN0_Error_IRQHandler,Default_Handler

    .weak      CAN0_Tx_Warning_IRQHandler
    .thumb_set CAN0_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN0_Rx_Warning_IRQHandler
    .thumb_set CAN0_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN0_Wake_Up_IRQHandler
    .thumb_set CAN0_Wake_Up_IRQHandler,Default_Handler

    .weak      PWM0_CMP0_IRQHandler
    .thumb_set PWM0_CMP0_IRQHandler,Default_Handler

    .weak      PWM0_RELOAD0_IRQHandler
    .thumb_set PWM0_RELOAD0_IRQHandler,Default_Handler

    .weak      PWM0_CMP1_IRQHandler
    .thumb_set PWM0_CMP1_IRQHandler,Default_Handler

    .weak      PWM0_RELOAD1_IRQHandler
    .thumb_set PWM0_RELOAD1_IRQHandler,Default_Handler

    .weak      PWM0_CMP2_IRQHandler
    .thumb_set PWM0_CMP2_IRQHandler,Default_Handler

    .weak      PWM0_RELOAD2_IRQHandler
    .thumb_set PWM0_RELOAD2_IRQHandler,Default_Handler

    .weak      PWM0_CMP3_IRQHandler
    .thumb_set PWM0_CMP3_IRQHandler,Default_Handler

    .weak      PWM0_RELOAD3_IRQHandler
    .thumb_set PWM0_RELOAD3_IRQHandler,Default_Handler

    .weak      PWM0_CAP_IRQHandler
    .thumb_set PWM0_CAP_IRQHandler,Default_Handler

    .weak      PWM0_RERR_IRQHandler
    .thumb_set PWM0_RERR_IRQHandler,Default_Handler

    .weak      PWM0_FAULT_IRQHandler
    .thumb_set PWM0_FAULT_IRQHandler,Default_Handler

    .weak      CMP3_IRQHandler
    .thumb_set CMP3_IRQHandler,Default_Handler

    .weak      HSADC1_CCB_IRQHandler
    .thumb_set HSADC1_CCB_IRQHandler,Default_Handler

    .weak      CAN1_ORed_Message_buffer_IRQHandler
    .thumb_set CAN1_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN1_Bus_Off_IRQHandler
    .thumb_set CAN1_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN1_Error_IRQHandler
    .thumb_set CAN1_Error_IRQHandler,Default_Handler

    .weak      CAN1_Tx_Warning_IRQHandler
    .thumb_set CAN1_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN1_Rx_Warning_IRQHandler
    .thumb_set CAN1_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN1_Wake_Up_IRQHandler
    .thumb_set CAN1_Wake_Up_IRQHandler,Default_Handler

    .weak      ENET_1588_Timer_IRQHandler
    .thumb_set ENET_1588_Timer_IRQHandler,Default_Handler

    .weak      ENET_Transmit_IRQHandler
    .thumb_set ENET_Transmit_IRQHandler,Default_Handler

    .weak      ENET_Receive_IRQHandler
    .thumb_set ENET_Receive_IRQHandler,Default_Handler

    .weak      ENET_Error_IRQHandler
    .thumb_set ENET_Error_IRQHandler,Default_Handler

    .weak      PWM1_CMP0_IRQHandler
    .thumb_set PWM1_CMP0_IRQHandler,Default_Handler

    .weak      PWM1_RELOAD0_IRQHandler
    .thumb_set PWM1_RELOAD0_IRQHandler,Default_Handler

    .weak      PWM1_CMP1_IRQHandler
    .thumb_set PWM1_CMP1_IRQHandler,Default_Handler

    .weak      PWM1_RELOAD1_IRQHandler
    .thumb_set PWM1_RELOAD1_IRQHandler,Default_Handler

    .weak      PWM1_CMP2_IRQHandler
    .thumb_set PWM1_CMP2_IRQHandler,Default_Handler

    .weak      PWM1_RELOAD2_IRQHandler
    .thumb_set PWM1_RELOAD2_IRQHandler,Default_Handler

    .weak      PWM1_CMP3_IRQHandler
    .thumb_set PWM1_CMP3_IRQHandler,Default_Handler

    .weak      PWM1_RELOAD3_IRQHandler
    .thumb_set PWM1_RELOAD3_IRQHandler,Default_Handler

    .weak      PWM1_CAP_IRQHandler
    .thumb_set PWM1_CAP_IRQHandler,Default_Handler

    .weak      PWM1_RERR_IRQHandler
    .thumb_set PWM1_RERR_IRQHandler,Default_Handler

    .weak      PWM1_FAULT_IRQHandler
    .thumb_set PWM1_FAULT_IRQHandler,Default_Handler

    .weak      CAN2_ORed_Message_buffer_IRQHandler
    .thumb_set CAN2_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN2_Bus_Off_IRQHandler
    .thumb_set CAN2_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN2_Error_IRQHandler
    .thumb_set CAN2_Error_IRQHandler,Default_Handler

    .weak      CAN2_Tx_Warning_IRQHandler
    .thumb_set CAN2_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN2_Rx_Warning_IRQHandler
    .thumb_set CAN2_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN2_Wake_Up_IRQHandler
    .thumb_set CAN2_Wake_Up_IRQHandler,Default_Handler
